#ifndef _SM3_H_
#define _SM3_H_
/***********************************************************************************************************************
 *  INCLUDES
 **********************************************************************************************************************/
#include "Type.h"

/* data type 
typedef unsigned char  U8;
typedef char S8;
typedef unsigned short U16;
typedef unsigned int   U32;
*/
/***********************************************************************************************************************
 *   VERSION CHECK
 **********************************************************************************************************************/

/***********************************************************************************************************************
 *  DEFINES & MACROS
 **********************************************************************************************************************/
#define SM3_BLOCK_WORD_LEN (16)
#define SM3_BLOCK_BYTE_LEN (64)
#define SM3_DIGEST_WORD_LEN (8)
#define SM3_DIGEST_BYTE_LEN (32)

#define SM3_MAC_IPAD  (0x36363636)
#define SM3_MAC_OPAD  (0x5c5c5c5c)
#define SM3_MAC_IPAD_OPAD  (SM3_MAC_IPAD ^ SM3_MAC_OPAD)

/***********************************************************************************************************************
 *  TYPEDEFS
 **********************************************************************************************************************/
/***************************************************************************************************
 *     如下结构体定义中，U32 hash[8] 可以替换为 U32 *hash，对应的，接口SM3_Init和SM3_Done
 * 要做修正，即将后者的参数U8 digest[32]移动到前者中。指针hash指向digest。
 *     如此修正可节省32字节的内存空间，但对不支持非字对齐的平台，需要人为要求digest是字对齐地址才行，
 * 否则会执行异常
 *     而不做修改的话，则无论环境是否支持字对齐，均可正常处理
 ***************************************************************************************************/

/* type to hold the SM3 context */
typedef struct
{
    U32 count[2];  //存储已经输入消息的比特长度
    U32 hash[SM3_DIGEST_WORD_LEN];   //U32 *hash; 用于存放中间及最终结果
    U32 wbuf[SM3_BLOCK_WORD_LEN];
}SM3_CTX;

typedef SM3_CTX SM3_Ctx;

//SM3 HMAC context
typedef struct
{
	U32 K0[SM3_BLOCK_WORD_LEN];
	SM3_CTX sm3_ctx[1];
} SM3_HMAC_CTX;

typedef SM3_HMAC_CTX SM3_HMAC_Ctx;
/***********************************************************************************************************************
 *  CONSTANTS
 **********************************************************************************************************************/

/***********************************************************************************************************************
 *  GLOBAL VARIABLES
 **********************************************************************************************************************/

//定义返回值错误码
enum SM3_RET_CODE
{
	SM3_SUCCESS = 0, 
	SM3_BUFFER_NULL,            // 空指针
	SM3_INPUT_TOO_LONG,          // 输入消息太长
//	SM3InOutSameBuffer        // 输入输出同一个buffer
};

/***********************************************************************************************************************
 *  GLOBAL FUNCTION
 **********************************************************************************************************************/
U8 SM3_Init(SM3_CTX * ctx);

U8 SM3_Process(SM3_CTX * ctx, U8 * message, U32 byteLen);

U8 SM3_Done(SM3_CTX * ctx, U8 digest[SM3_DIGEST_BYTE_LEN]);

U8 SM3_Hash(U8 * message, U32 byteLen, U8 digest[SM3_DIGEST_BYTE_LEN]);



U8 SM3_HMAC_Init(SM3_HMAC_CTX *ctx, const U8 *key, U32 keyByteLen);

U8 SM3_HMAC_Process(SM3_HMAC_CTX *ctx, const U8 *input, U32 byteLen);

U8 SM3_HMAC_Done(SM3_HMAC_CTX *ctx, U8 mac[SM3_DIGEST_BYTE_LEN]);

U8 SM3_HMAC(const U8 *key, U32 keyByteLen, const U8 *msg, U32 msgByteLen, U8 mac[SM3_DIGEST_BYTE_LEN]);

#endif
